{
    "case title": "An Irregular Meeting",
    "date": "London, 18th September 1880",
    "intro": "The streets of London are a harsh place for young children. With no parents to care for us, we scavenge for goods on the street. And amongst the hardship, we have formed some strong friendships. We met Wiggins a month ago. A confident and witty 7-year-old (a year older than most of us), we have already begun to see him as our natural leader. Early one Saturday morning, he gathers us together.\n\n“Last week,” he tells us, “I became acquainted with a distinguished gentleman, a ‘consulting detective’ so he calls himself, who goes by the name of Mr. Sherlock Holmes. I helped him in a little matter, and he was flush with praise. Now, he’s asked me to form a gang of plucky and sharp-witted folk, what will be like an unofficial police force, at his disposal.”\n\n“So we’d help solve crimes?” asks Tinker, the youngest of us.\n“That’s it,” replies Wiggins, and we begin to chatter excitedly.\n“And,” he continues, raising his voice to be heard, “in return, we garner a shilling per day, and a guinea for a vital clue! But first, there is a test.”\n\n“A test?” exclaims Simpson, a stocky, red-haired boy. “Like at school?”\nWe burst into raucous laughter.\n“No,” replies Wiggins, grinning. “Not a jot like school. Mr. Holmes needs to know we’re up to the work. You’ve heard of Gilly the Ghost?”\n\nWe nod. Gilly the Ghost – real name Gilly Niles – is one of the most notorious thieves of the West End. An expert in disguise, she can change her appearance in seconds, making any pursuers think she’s vanished into the air. Once, disguised as a male doorman, she made away with a hotel guest’s entire set of luggage. She also worked as an actress until she was caught stealing from the theatre and spent seven months in Millbank Prison. Some of us know her by sight: she is in her twenties, has brown hair, and seems constantly on the alert.\n\n“Gilly’s been seen around Trafalgar Square a lot of late,” Wiggins continues. “Mr. Holmes believes she has some kind of skullduggery in mind. He’s given us two tasks. First, we must find out what she’s planning. Second, we must try to stop her plan from going ahead. So lads, do you want to be detectives?”\n\nOur response is an enthusiastic roar.\n“Well then, let’s show Mr. Holmes what we’re made of!”",
   
    "outro": "In a lofty chamber of St. Bart’s Hospital, a lone figure is hunched over a bench, working feverishly with a set of bubbling test tubes.\n\n“Wiggins,” he says. “I have seen rooms on Baker Street I intend to take if only I can find a fellow willing to share them. With luck, you will not have to visit this dim laboratory again.\n\nBut now – Gilly the Ghost! I assume you went to her sister Lydia first, whose description of Gilly’s lodging leads to the stable yard rooms listed in *The Times*. Lydia also said Gilly worked for the Haymarket, and they say they caught her stealing and got her sent to prison in ’79.\n\nAha! Perhaps Gilly wants revenge but has found it difficult because the Haymarket staff say they recognize her even when disguised. Today, she went to Covent Garden Market to collect old fruit and purchase a sailor’s knife.\n\nSo, disguised as a staff member, she plans to enter the Colonial Institute – the National Gallery would have too much security – and then cross the arch to the theatre, just as *Moby Dick* begins.\n\nCutting the rope ladder to the balcony, she will pelt the actors with rotten fruit, carried in the bag – note she had been conducting target practice on a barrel in the stable yard at 68 WC.\n\nFinally, she could cut the ropes on the plaster whale, letting it fall and shatter, putting an end to the production.\n\nHowever, with your particular talents, I imagine you may have found a way to destroy her disguise and foil her plan.\n\nThe detective walks over and crouches.\n\n“Wiggins, I am impressed enough to appoint you and your associates as my unofficial force – the Irregulars!”\n\nHe turns to address us directly.\n\n“You must know that working for me will test you to your limits, and perhaps beyond. It will not be easy. But I can promise you this my young friends: you will never want for excitement. There is nothing like the thrill of the chase when the game is afoot!”\n\nHe thrusts a copy of *The Times* into our hands – a death notice circled in red – and then leans forward with an enigmatic smile we will come to know well.\n\n“So,” he whispers, “Shall we begin?”",

        "case_summary": {
            "leads": [
                {"name": "Lydia Niles (33 WC)"},
                {"name": "Gilly (68 WC)"},
                {"name": "Covent Garden (28 WC)"},
                {"name": "the Haymarket (4 SW)"},
                {"name": "Colonial Institute (86 SW)"}
            ],
            "case_description": "Holmes would have solved this case in 5 leads"
        }
      }
      
      
  